spec/sem4r/report_definition/fixtures/getReportFields-req.xml

<!-- Post to 'https://adwords-sandbox.google.com/api/adwords/cm/v201008/ReportDefinitionService' -->
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns="https://adwords.google.com/api/adwords/cm/v201008">
   <env:Header>
      <RequestHeader env:mustUnderstand="0">
         <authToken>***censured***</authToken>
         <userAgent>Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)</userAgent>
         <developerToken>***censured***</developerToken>
      </RequestHeader>
   </env:Header>
   <env:Body>
      <getReportFields>
         <reportType>KEYWORDS_PERFORMANCE_REPORT</reportType>
      </getReportFields>
   </env:Body>
</env:Envelope>
